{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend source files.",
  "frontend/index.css": "Tailwind base setup with OKLCH color variables and global background/foreground styling.",
  "frontend/index.html": "HTML entry point loading Press Start 2P font and mounting the React app.",
  "frontend/src/App.tsx": "Root component centering the ReactionGameScreen in the viewport.",
  "frontend/src/game/assets.ts": "Centralized paths for the two game images used in idle and reaction states.",
  "frontend/src/game/constants.ts": "Timing configuration for delays, overlays, and penalty durations.",
  "frontend/src/game/copy.ts": "Intro text constants reused across game screens.",
  "frontend/src/game/domToPng.ts": "Utility converting DOM elements to PNG blobs using foreignObject and canvas.",
  "frontend/src/game/pixelStyles.ts": "Exports shared pixel-art themed Tailwind class presets for typography, cards, overlays, buttons, and status colors.",
  "frontend/src/game/ReactionGameScreen.tsx": "Main game UI handling game state transitions, image display, overlays, and navigation to result/share preview screens.",
  "frontend/src/game/ResultScreen.tsx": "Result view showing reaction time, performance message, and buttons for replay and sharing.",
  "frontend/src/game/share.ts": "Implements image sharing via the Web Share API, returning structured success or error results.",
  "frontend/src/game/SharePreviewScreen.tsx": "Share preview card rendering the result image, creating PNG snapshots, and showing screenshot instructions when sharing fails.",
  "frontend/src/game/useReactionGame.ts": "Provides a React hook managing the reaction game's state machine, timing logic, penalties, and transitions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity, and status states.",
  "frontend/src/index.css": "Defines global Tailwind layers and winter-themed OKLCH color variables plus background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including OKLCH color tokens, pixel font, shadows, and plugins.",
  "project_state.json": "Describes the project state, requirements, issues, and planned features for the reaction game and share workflow."
}