{
  "kind": "build_request",
  "title": "Replace broken share-card download with screenshot/share instructions and improve reaction-time emphasis on share card",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-29",
      "text": "Remove the non-working share-card save/download behavior and replace it with an on-screen instruction on the Share Preview screen that tells the user to take a screenshot and share it on social media when native sharing is not available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Ukládací začít co. stále nefunguje. Ale nepotřebujeme ho. Můžem ho nahradit nápisem, výzvou aby si udělali screenshot a sdíleli na sociálních sítích."
        ]
      },
      "acceptanceCriteria": [
        "On the Share Preview screen, there is a clearly visible instruction in English telling users to take a screenshot and share it on social media (e.g., \"If Share doesn’t work, take a screenshot and share it on social media.\").",
        "Tapping the Share button no longer triggers an automatic file download as a fallback (no \"Image downloaded!\" toast).",
        "If Web Share (with files) is unsupported or fails, the UI provides the screenshot instruction rather than attempting to download."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Update the Share Preview card layout so the reaction time value is larger and uses a more prominent, higher-contrast color than the surrounding sentence text, while keeping the existing exact sentence: “your reaction time to Boo is <XY>ms. Excellent!”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Možná bych na sdílecí kartě zvětšil cislo Času reakční doby. A možná mu dali jinou, výraznější barvu."
        ]
      },
      "acceptanceCriteria": [
        "On the Share Preview card, the reaction time number is visually emphasized (larger font size than the surrounding text).",
        "The reaction time number uses a more prominent color (e.g., accent/primary) than the surrounding sentence text, improving readability on the existing winter-glass background.",
        "The user-facing sentence remains exactly: \"your reaction time to Boo is <XY>ms. Excellent!\" (with <XY> replaced by the measured reaction time in milliseconds)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add backend logic; keep the backend as-is (single Motoko actor remains empty).",
    "Use English for any new user-facing text."
  ],
  "nonGoals": [
    "Do not add or reintroduce a dedicated Download button on the Share Preview screen.",
    "Do not change the existing game flow/state machine beyond what is needed for the share preview messaging and styling.",
    "Do not implement any external/social-media API integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}