{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Share Preview sharing fallback and emphasize reaction time on share card",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Remove broken share-card download fallback and show screenshot/share instruction when native sharing is unavailable or fails",
      "acceptanceCriteria": [
        "On the Share Preview screen, there is a clearly visible instruction in English telling users to take a screenshot and share it on social media (e.g., \"If Share doesn’t work, take a screenshot and share it on social media.\").",
        "Tapping the Share button no longer triggers an automatic file download as a fallback (no \"Image downloaded!\" toast).",
        "If Web Share (with files) is unsupported or fails, the UI provides the screenshot instruction rather than attempting to download."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/share.ts",
          "operation": "modify",
          "description": "Remove the download-based fallback from share behavior so sharing either uses Web Share (with files) or returns a non-success result; ensure failures are reported in a way the UI can use to show screenshot instructions rather than downloading."
        },
        {
          "path": "frontend/src/game/SharePreviewScreen.tsx",
          "operation": "modify",
          "description": "Update Share Preview UI/logic to: (1) stop showing any download-related success toast, (2) display a clearly visible English instruction telling users to take a screenshot and share on social media when native sharing is not available or fails, and (3) keep the existing Share button using the shadcn-ui Button component for consistent styling (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Emphasize the reaction-time value on the Share Preview card with larger size and higher-contrast color while keeping the exact sentence text",
      "acceptanceCriteria": [
        "On the Share Preview card, the reaction time number is visually emphasized (larger font size than the surrounding text).",
        "The reaction time number uses a more prominent color (e.g., accent/primary) than the surrounding sentence text, improving readability on the existing winter-glass background.",
        "The user-facing sentence remains exactly: \"your reaction time to Boo is <XY>ms. Excellent!\" (with <XY> replaced by the measured reaction time in milliseconds)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/SharePreviewScreen.tsx",
          "operation": "modify",
          "description": "Adjust the Share Preview card's reaction-time sentence rendering so the numeric value is wrapped/styled as a larger, higher-contrast inline element (e.g., accent/primary), while the surrounding text is less prominent; preserve the sentence exactly as: \"your reaction time to Boo is <XY>ms. Excellent!\"."
        },
        {
          "path": "frontend/src/game/pixelStyles.ts",
          "operation": "modify",
          "description": "Add or refine a shared style token/class string (if needed) to support higher-contrast emphasized numeric text on the winter-glass card without changing overall game flow; keep usage consistent with existing Tailwind/pixel style conventions."
        }
      ]
    }
  ]
}